ERM/src/Catalogs/EscalationLevels.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>EscalationLevels</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DaysFromTheStartingDate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LevelID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Members</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Member</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ERM/src/Catalogs/EscalationLevels/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ПолучитьВышестоящиеУровни(ТекущийУровень, ВключаяТекущий = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EscalationLevels.Ссылка,
		|	EscalationLevels.DaysFromTheStartingDate
		|ИЗ
		|	Справочник.EscalationLevels КАК EscalationLevels
		|ГДЕ
		|	НЕ EscalationLevels.ПометкаУдаления
		|	И EscalationLevels.LevelID > &ТекущийУровень";
	
	Запрос.УстановитьПараметр("ТекущийУровень", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийУровень, "LevelID"));
	Если ВключаяТекущий Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "EscalationLevels.LevelID > &ТекущийУровень", "EscalationLevels.LevelID >= &ТекущийУровень");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
